IdeaRS.OpenModel.Material.ReinfDiagramType
Reinforcement stress-strain diagram

IdeaRS.OpenModel.Material.ReinfDiagramType.BilinerWithAnInclinedTopBranch
Billinear with an inclined top branch

IdeaRS.OpenModel.Material.ReinfDiagramType.BilinerWithOutAnInclinedTopBranch
Billinear without an inclined top branch

IdeaRS.OpenModel.Material.ReinfDiagramType.DefinedByUser
Defined by user